transformation-library/src/test/resources/patientprofile/dsq.response/deceased.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
    <s:Header>
        <cais:TrackingId xmlns:cais="http://cais-icp.org/v1">75018de5-2ecd-4d67-b4cc-ac80ee6d9f30</cais:TrackingId>
        <cais:TransactionId xmlns:cais="http://cais-icp.org/v1">6431f03a-b8c0-496f-bedc-d7fcba1659fe
        </cais:TransactionId>
        <cais:SessionID xmlns:cais="http://cais-icp.org/v1">8546761d59be48e489eb375157c10</cais:SessionID>
    </s:Header>
    <s:Body>
        <PRPA_IN101104CA xmlns="urn:hl7-org:v3" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
                         ITSVersion="XML_1.0">
            <id root="b050c76c-744d-49ae-8d82-d908d4bbc8f0"/>
            <creationTime value="20210922191548"/>
            <responseModeCode code="I"/>
            <versionCode code="NE2006"/>
            <interactionId root="2.16.124.10.101.1.60.5.2.111" extension="PRPA_IN101104CA" displayable="true"/>
            <processingCode code="D"/>
            <processingModeCode code="T"/>
            <acceptAckCode code="AL"/>
            <receiver typeCode="RCV">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="VPHXApplicationOID" extension="VPHXApplicationShortName" use="BUS"/>
                    <agent xsi:nil="true"/>
                </device>
            </receiver>
            <respondTo xsi:nil="true"/>
            <sender typeCode="SND">
                <device classCode="DEV" determinerCode="INSTANCE">
                    <id root="2.16.124.10.101.1.60.2.10" extension="RU" use="BUS"/>
                    <name>Registre des usagers</name>
                    <agent xsi:nil="true"/>
                </device>
            </sender>
            <acknowledgement>
                <typeCode code="AA"/>
                <targetMessage>
                    <id root="D977D3CBFDD260D5E9705B6D48413ECA7D35B0C8D859922324D3202B3A115485"/>
                </targetMessage>
            </acknowledgement>
            <controlActEvent moodCode="EVN">
                <id root="VPHXApplicationOID" extension="4567" use="BUS"/>
                <code code="PRPA_TE101104CA" codeSystem="2.16.840.1.113883.11.19427"/>
                <statusCode code="completed"/>
                <subject typeCode="SUBJ" contextControlCode="ON">
                    <registrationEvent classCode="REG" moodCode="EVN">
                        <statusCode code="active"/>
                        <subject contextControlCode="AN">
                            <identifiedEntity classCode="IDENT">
                                <id root="2.16.840.1.113883.4.56" extension="8000000110" displayable="false"/>
                                <id root="2.16.124.10.101.1.60.100" extension="LACM30010115" displayable="true"/>
                                <statusCode code="active"/>
                                <effectiveTime>
                                    <low value="20210922"/>
                                    <high nullFlavor="NI"/>
                                </effectiveTime>
                                <confidentialityCode code="NI"/>
                                <identifiedPerson classCode="PSN" determinerCode="INSTANCE">
                                    <name>
                                        <given partType="GIV">Martin</given>
                                        <family partType="FAM">Lacasse</family>
                                    </name>
                                    <telecom nullFlavor="MSK"/>
                                    <administrativeGenderCode code="M"/>
                                    <birthTime value="19300101"/>
                                    <deceasedInd value="true"/>
                                    <deceasedTime value="20210101"/>
                                    <multipleBirthInd nullFlavor="UNK"/>
                                    <addr nullFlavor="UNK"/>
                                    <personalRelationship classCode="PRS">
                                        <code code="MTH"/>
                                        <relationshipHolder classCode="PSN" determinerCode="INSTANCE">
                                            <id nullFlavor="UNK"/>
                                            <name>
                                                <given partType="GIV">Monica Marlene</given>
                                                <family partType="FAM">Lacasse-Tremblay</family>
                                            </name>
                                        </relationshipHolder>
                                    </personalRelationship>
                                    <languageCommunication>
                                        <languageCode nullFlavor="MSK"/>
                                    </languageCommunication>
                                </identifiedPerson>
                                <subjectOf typeCode="SBJ">
                                    <observationEvent classCode="OBS" moodCode="EVN">
                                        <code code="ProbabilityMatchObservation"/>
                                        <value value="0.5990"/>
                                    </observationEvent>
                                </subjectOf>
                            </identifiedEntity>
                        </subject>
                        <custodian typeCode="CST" contextControlCode="AP">
                            <assignedDevice classCode="ASSIGNED">
                                <id root="2.16.124.10.101.1.60.2.10" extension="RU" use="BUS"/>
                                <assignedRepository classCode="DEV" determinerCode="INSTANCE">
                                    <name>Registre des usagers</name>
                                </assignedRepository>
                                <representedRepositoryJurisdiction classCode="STATE" determinerCode="INSTANCE">
                                    <name>Qu�bec</name>
                                </representedRepositoryJurisdiction>
                            </assignedDevice>
                        </custodian>
                    </registrationEvent>
                </subject>
                <queryAck>
                    <queryId root="D977D3CBFDD260D5E9705B6D48413ECA7D35B0C8D859922324D3202B3A115485"/>
                    <queryResponseCode code="OK"/>
                    <resultTotalQuantity value="1"/>
                    <resultCurrentQuantity value="1"/>
                    <resultRemainingQuantity value="0"/>
                </queryAck>
                <queryByParameter>
                    <queryId root="BB7321A1-3365-44BA-8F7C-AF54EF0F0146"/>
                    <parameterList>
                        <administrativeGender xsi:nil="true"/>
                        <clientId>
                            <value root="2.16.124.10.101.1.60.100" extension="LACM30010115"/>
                        </clientId>
                        <deceasedIndicator xsi:nil="true"/>
                        <deceasedTime xsi:nil="true"/>
                        <languageCode xsi:nil="true"/>
                        <multipleBirthIndicator xsi:nil="true"/>
                        <multipleBirthOrderNumber xsi:nil="true"/>
                        <personAddress>
                            <value>
                                <streetAddressLine partType="SAL"/>
                                <city partType="CTY"/>
                                <state partType="STA"/>
                                <country partType="CNT"/>
                                <postalCode partType="ZIP"/>
                            </value>
                        </personAddress>
                        <personBirthtime xsi:nil="true"/>
                        <personalRelationshipCode xsi:nil="true"/>
                    </parameterList>
                </queryByParameter>
            </controlActEvent>
        </PRPA_IN101104CA>
    </s:Body>
</s:Envelope>